# specify a directory to install
cask_args appdir: '/Applications'

# install packages
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "khanhas/tap"

brew 'git'
brew 'bash-completion'
brew 'fish'
brew 'wget'
brew 'glances'
brew 'node'
brew 'yarn'
brew 'nnn'
brew "peco"
brew 'redis'
brew 'screen'
brew 'tmux'
brew 'unrar'
brew 'speedtest-cli'
brew "khanhas/tap/spicetify-cli"
#brew 'yadm'

# Casks
# cask "alt-tab"
cask "android-file-transfer"
cask "android-platform-tools"
cask "another-redis-desktop-manager"
cask "appcleaner"
# cask "autumn"
# cask "barrier"
# cask "beardedspice"
# cask "brisync"
cask "coconutbattery"
# cask "fanny"
# cask "font-meslo-nerd-font-mono"
cask "gimp"
cask "hiddenbar"
cask "iina"
# cask "inkscape"
cask "insomnia"
# cask "mamp"
cask "megasync"
# cask "monitorcontrol"
cask "ngrok"
cask "obsidian"
# cask "onyx"
# cask "qlcolorcode"
# cask "qlimagesize"
# cask "qlmarkdown"
# cask "qlstephen"
# cask "quicklook-json"
cask "rectangle"
# cask "transmission"
cask "ueli"
# cask "vlc"


# A command to download mac store app
# http://www.softantenna.com/wp/mac/mas-cli/
# https://github.com/argon/mas
# tap 'argon/mas'
# brew 'mas'
# run download_apps later on
